{
  "submission_id": "SUB-33c32e9c-641b-484c-a74c-070b2f2d8ac7",
  "insured_name": "24-16 Queens Plaza South Condominium",
  "email": "### 🏢 Property Overview\nThe submission centers on a modern, high-rise condominium located at 24-16 Queens Plaza South, Long Island City, NY. Built in 2019, this 22-story, fire-resistive structure combines residential apartments with a mercantile (merc) component, specifically a bank tenant. The property spans <span style=\"color:yellow\">110,553 sq ft</span> and is valued at a <span style=\"color:green\">replacement cost</span> basis, reflecting a robust, contemporary asset profile in a dense urban environment. The insured's mailing address is 260 Madison Avenue, 12th Floor, New York, NY 10016.\n\n- 22-story, fire-resistive construction (built 2019)\n- Mixed-use: residential apartments and bank tenant (merc)\n- <span style=\"color:yellow\">110,553 sq ft</span> total area\n- Located in Long Island City, NY (Brooklyn reference in email, but address is Queens)\n- Replacement cost valuation (except ALS on Business Income)\n\n### 💰 Coverage Structure & Limits\nThe broker requests a comprehensive all-risk property program, including <span style=\"color:yellow\">flood, earthquake (EQ), and equipment breakdown</span>. The total insured value (TIV) is <span style=\"color:green\">$52,615,000</span>, with specific limits for building, business personal property (BPP), and business income/extra expense (BI/EE). Ordinance or Law coverage is sought at <span style=\"color:yellow\">Full A and 10% B&C</span>.\n\n- Building: <span style=\"color:green\">$50,905,000</span>\n- BPP: <span style=\"color:yellow\">$100,000</span>\n- BI/EE: <span style=\"color:yellow\">$1,610,000</span>\n- TIV: <span style=\"color:green\">$52,615,000</span>\n- Ordinance or Law: Full A, 10% B&C\n- Valuation: Replacement Cost (except ALS on BI)\n\n### 🛡️ Deductibles & Special Terms\nThe submission outlines a detailed deductible structure, reflecting the insured's appetite for risk retention across various perils. Notably, the <span style=\"color:yellow\">flood and earthquake deductibles</span> are set at <span style=\"color:yellow\">$100,000</span> and <span style=\"color:yellow\">$50,000</span> per occurrence, respectively, with similar retentions for water damage and sewer backup. The all other perils (AOP) deductible is <span style=\"color:yellow\">$25,000 per occurrence</span>.\n\n- EQ: <span style=\"color:yellow\">$50,000 per occurrence</span>\n- Flood: <span style=\"color:yellow\">$100,000 per occurrence</span>\n- Sewer Backup: <span style=\"color:yellow\">$50,000</span>\n- Water Damage: <span style=\"color:yellow\">$50,000</span>\n- AOP: <span style=\"color:yellow\">$25,000 per occurrence</span>\n\n### 📄 Loss History & Attachments\nThe submission includes loss runs for the past two years, both involving <span style=\"color:red\">accidental discharge from plumbing</span>. The 2020-2021 period saw a loss of <span style=\"color:red\">$230,003</span>, while the 2021-2022 period experienced a significantly higher loss of <span style=\"color:red\">$945,933</span>. These figures highlight a <span style=\"color:red\">notable water damage exposure</span> that warrants further scrutiny. Attachments also include the SOV and full loss runs for detailed review.\n\n- 3/12/2020–12/2021: Accidental plumbing discharge, <span style=\"color:red\">$230,003</span>\n- 3/12/2021–3/12/2022: Accidental plumbing discharge, <span style=\"color:red\">$945,933</span>\n- SOV and loss runs provided as attachments\n\n### 🏦 Occupancy & Tenant Profile\nThe property is a mixed-use asset with residential apartments and a mercantile component, specifically a bank tenant. This occupancy mix can be favorable from a risk perspective, as financial institutions typically maintain high standards for security and maintenance. However, the presence of a bank may also introduce unique exposures (e.g., higher foot traffic, cash handling).\n\n- Residential apartments (primary use)\n- Mercantile tenant: bank\n- Potential for <span style=\"color:yellow\">increased water damage risk</span> due to recent loss history\n- Bank occupancy may enhance overall risk profile but requires confirmation of tenant risk controls\n\n\n---\n\nI can help with a few things — which would you like me to handle next?\n  1. Email the broker to request the missing information: confirmation of occupancy breakdown (residential vs. mercantile sq ft), details on water damage mitigation measures post-loss, and clarification on the correct borough (Brooklyn vs. Queens).\n  2. Find out more about the insured.\n  3. Review or create a summary of the Loss Run (if available).\n  4. Review or create a summary of the SOVs (if available).",
  "insured": "24-16 Queens Plaza South Condominium, also known as Hero LIC, is a luxury residential condominium tower located in Long Island City, Queens, New York. Developed by Silverback Development, this 22-story Art-Moderne skyscraper stands at the foot of the Queensboro Bridge and is recognized for its contemporary elegance and extensive amenities, catering to urban professionals and residents seeking upscale living [https://www.cityrealty.com/nyc/long-island-city/hero-lic-24-16-queens-plaza-south/76451].\n\nKey operational details:\n- The building comprises 109 condominium units, ranging from studios to two-bedrooms, with recent listings showing prices between $699,888 and $750,000 for smaller units [https://nyc.marketproof.com/article/just-listed-for-699k-long-island-city-studio-condo-at-2416-queens-plaza-south-_-hero-11101-by-rebnyidxserhant-on-jul-7th-2025], [https://www.nestseekers.com/1312803/2416-queens-plaza-south-1-br-condo-queens-plaza-south-long-island].\n- Residents enjoy over 15,000 square feet of amenities, including a 24/7 doorman-attended lobby, rooftop deck with sky lounge and BBQ grills, yoga studio, wellness center, multipurpose dining space, package room, bike storage, pet spa, and Zen garden [https://www.herolic.com/], [https://streeteasy.com/building/hero-condominium].\n- The building features modern design elements such as curvy balconies, white oak flooring, and expansive windows offering city and river views [https://www.hlres.com/buildings/nyc/hero-24-16-queens-plaza-south/759700/condo], [https://serhant.com/properties/24-16-queens-plaza-south-unit-20-e].\n- Construction of the tower is complete, and the property is actively managed as a full-service luxury condominium [https://northernarchitecturalsystems.com/hero-lic-completed-at-24-16-queens-plaza-south/].\n\nRecent developments and underwriting-relevant context:\n- The condominium is relatively new, with construction completed in recent years and no publicly reported safety violations or legal disputes associated with the property [https://fieldcondition.com/blog/2019/10/3/construction-tour-hero-24-16-queens-plaza-south].\n- Financial statements for the condominium are available, indicating ongoing management and transparency in operations [https://www.domecile.com/buildings/42_02_Crescent_Street].\n- The property is located in a rapidly developing and desirable neighborhood, which may contribute to stable property values and low vacancy rates [https://www.corcoran.com/building/long-island-city/566476].\n\nOverall, 24-16 Queens Plaza South Condominium presents as a well-managed, amenity-rich residential property with no immediate underwriting red flags based on available public information.",
  "sov": "## 🏢 Property Overview\nThe submission details a single location: **24-16 Queens Plaza South Condominium** in Long Island City, NY. The property is a condominium structure, identified as Building 1, with a substantial <span style=\"color:yellow\">110,553 square feet</span> and <span style=\"color:yellow\">109 units</span>. The building was constructed in <span style=\"color:yellow\">2019</span>, indicating modern standards and likely compliance with recent building codes. However, the SOV lacks critical financial and occupancy data, which limits the ability to fully assess risk exposure and valuation accuracy.\n\n## 🛠️ Construction & Condition\nThe SOV lists the property type as \"FR\" (presumably Fire Resistive), which is generally favorable for risk mitigation. However, there is <span style=\"color:red\">no information provided on construction details, roof condition, or updates</span>. The absence of roof replacement year and construction description raises concerns about long-term durability and maintenance standards.\n\n## 📊 Valuation & Occupancy\nAll value fields—including building, contents, BI/rental, M&E, and other—are reported as <span style=\"color:red\">zero</span>, resulting in a <span style=\"color:red\">TIV of zero</span>. This is a critical issue, as it prevents any meaningful assessment of insurable interest or premium calculation. Additionally, occupancy details are missing, with <span style=\"color:red\">zero percent occupancy</span> and no descriptive information, which is inconsistent with the presence of 109 units and a recent build year.\n\n## 📝 Key Facts & Considerations\n- <span style=\"color:yellow\">Location:</span> Long Island City, NY, zip code 11101\n- <span style=\"color:yellow\">Year Built:</span> 2019 (recent construction)\n- <span style=\"color:yellow\">Square Footage:</span> 110,553; <span style=\"color:yellow\">Units:</span> 109\n- <span style=\"color:red\">All valuation fields are zero</span> (building, contents, BI/rental, M&E, other, TIV)\n- <span style=\"color:red\">Occupancy and construction details are missing or incomplete</span>\n- <span style=\"color:yellow\">No ownership entity specified</span>\n- <span style=\"color:yellow\">No updates or roof replacement year provided</span>\n\n## 🚦 Risk Implications\nThe lack of valuation and occupancy data is a <span style=\"color:red\">critical barrier</span> to underwriting. Without these details, risk exposure, premium adequacy, and coverage needs cannot be determined. The recent build year and fire resistive type are <span style=\"color:green\">positive indicators</span>, but the absence of supporting information introduces significant uncertainty.\n\n\n---\n\nI can help with a few things — which would you like me to handle next?\n  1. Email the broker to request the missing information: Building Value, Contents Value, BI/Rental Value, M&E Value, Other Value, Total Insured Value (TIV), Occupancy Description, Percentage Occupied, Construction Description, Roof Condition, Ownership Entity, Year Updated, Roof Replacement Year, AIR Occupancy and Construction Codes/Descriptions.\n  2. Review additional SOV data if available.\n  3. Summarize risk implications for underwriting referral.\n  4. Draft preliminary underwriting questions for the insured.",
  "loss_run": {
    "dynamic_narrative_analysis_sections": [
      {
        "section_title": "📊 Loss History Overview",
        "narrative": "The account presents a mixed loss history over the past four years, with two significant water damage claims stemming from burst sprinkler heads in the fitness room. Notably, there are years with no reported losses, suggesting intermittent but severe exposures. The most recent policy year lacks loss data, which introduces some uncertainty into the current risk profile.",
        "bullets": [
          "Two large water damage claims occurred in consecutive years (2021 and 2022).",
          "No losses were reported in the 2020–2021 and 2023–2024 periods.",
          "Loss runs for the 2024 policy year are missing, limiting full trend analysis.",
          "All reported claims are closed and non-litigated."
        ]
      },
      {
        "section_title": "💧 Water Damage Claim Pattern",
        "narrative": "A clear pattern emerges with repeated water damage incidents linked to the same cause and location. This repetition highlights a potential vulnerability in the insured’s property maintenance or sprinkler system design, warranting further risk control measures.",
        "bullets": [
          "Both water damage claims originated from burst sprinkler heads in the fitness room.",
          "The claims were classified as attritional, not catastrophic.",
          "No litigation was associated with either claim.",
          "No similar losses reported outside the two-claim period."
        ]
      },
      {
        "section_title": "🔍 Risk Implications & Underwriting Considerations",
        "narrative": "The recurrence and severity of water damage claims suggest a need for targeted risk mitigation, particularly regarding sprinkler system maintenance and fitness room oversight. The absence of catastrophic or litigated claims is favorable, but the high incurred amounts elevate the account’s loss severity profile. The lack of current-year loss data is a notable gap, requiring clarification before final underwriting decisions.",
        "bullets": [
          "High severity of past water damage claims increases risk exposure.",
          "No catastrophic or litigated claims reported, reducing legal and aggregation concerns.",
          "Missing loss run for the current year should be addressed prior to binding.",
          "Recommend inquiry into sprinkler system upgrades or maintenance protocols."
        ]
      }
    ],
    "numerical_trends": [
      {
        "year": 2020,
        "loss_amount": 0,
        "claims_count": 0
      },
      {
        "year": 2021,
        "loss_amount": 230003,
        "claims_count": 1
      },
      {
        "year": 2022,
        "loss_amount": 945134,
        "claims_count": 1
      },
      {
        "year": 2023,
        "loss_amount": 0,
        "claims_count": 0
      }
    ]
  },
  "sov_charts": {
    "coverageData": [
      {
        "Coverage": "Building Value",
        "TIV": 5100000.0,
        "Percent": 79.4
      },
      {
        "Coverage": "Contents Value",
        "TIV": 500000.0,
        "Percent": 7.8
      },
      {
        "Coverage": "BI/Rental Value",
        "TIV": 750000.0,
        "Percent": 11.7
      },
      {
        "Coverage": "M&E Value",
        "TIV": 0.0,
        "Percent": 0.0
      },
      {
        "Coverage": "Other Value",
        "TIV": 70000.0,
        "Percent": 1.1
      }
    ],
    "occupancyData": [
      {
        "Occupancy": "Hotel",
        "TIV": 6350000,
        "Percent": 98.9
      },
      {
        "Occupancy": "Unknown",
        "TIV": 70000,
        "Percent": 1.1
      }
    ],
    "constructionData": [
      {
        "Construction": "Frame",
        "TIV": 6350000,
        "Percent": 98.9
      },
      {
        "Construction": "Unknown",
        "TIV": 70000,
        "Percent": 1.1
      }
    ],
    "yearBuiltData": [
      {
        "Year": "2000-2009",
        "TIV": 6420000,
        "Percent": 100.0
      }
    ]
  }
}